html/research/emulab.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emulab相关</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Emulab相关"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-31T16:13+0800"/>
<meta name="author" content="ZHAO Xin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/default.css"/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emulab相关</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">存在问题</a>
<ul>
<li><a href="#sec-1-1">snmpit脚本中创建vlan，配置端口速率等函数如何写</a>
<ul>
<li><a href="#sec-1-1-1">参考其它脚本, 但存在很多问题.</a></li>
<li><a href="#sec-1-1-2">结合UCD-snmp命令行工具, 华为mibs库</a>
<ul>
<li><a href="#sec-1-1-2-1">编写脚本时注意的小问题</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1-2">ssh登录到node</a>
<ul>
<li><a href="#sec-1-2-1">root password什么时候用?</a></li>
<li><a href="#sec-1-2-2">解决方法</a></li>
</ul>
</li>
<li><a href="#sec-1-3">图形化拓扑工具使用</a>
<ul>
<li><a href="#sec-1-3-1">Bad Response</a></li>
<li><a href="#sec-1-3-2">用gui开始实验提示 none type</a></li>
</ul>
</li>
<li><a href="#sec-1-4">free节点经常不成功</a></li>
<li><a href="#sec-1-5">虚拟节点使用, 连接探针</a>
<ul>
<li><a href="#sec-1-5-1">虚拟节点启动不成功</a></li>
</ul>
</li>
<li><a href="#sec-1-6">指定时间的ns事件</a></li>
</ul>
</li>
<li><a href="#sec-2">阅读 wiki 笔记</a>
<ul>
<li><a href="#sec-2-1">DeathByDHCP.html, 实验网DHCP问题</a></li>
</ul>
</li>
<li><a href="#sec-3">常用命令</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">存在问题</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="todo DOING">DOING</span> snmpit脚本中创建vlan，配置端口速率等函数如何写</h3>
<div class="outline-text-3" id="text-1-1">

<p>交换机软件版本：v200r001c00spc300
</p>
</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">参考其它脚本, 但存在很多问题.</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>get1等通用的可借鉴, 但CreateVlan, VlanList等基本不可用
</p></div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">结合UCD-snmp命令行工具, 华为mibs库</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>MIB库内容参考, 命令行工具测试, 再配合其它脚本参考着写.
</p>
<ul>
<li>通过4008229999咨询得到 vlan 配置的 oid
</li>
</ul>

<p>2011.5.25.42.3.1.1.1.1.12 hwL2VlanRowStatus
</p><ul>
<li>相近位置找到添加删除端口到vlan的oid
</li>
</ul>

<p>2011.5.25.42.3.1.1.1.1.3 hwL2VlanPortList
</p>

</div>

<div id="outline-container-1-1-2-1" class="outline-5">
<h5 id="sec-1-1-2-1">编写脚本时注意的小问题</h5>
<div class="outline-text-5" id="text-1-1-2-1">

<ul>
<li>添加 HUAWEI-L2VLAN-MIB 到脚本解析mib库列表中
</li>
<li>脚本中 readifindex() 从 ifDescr oid 获得的端口 mod.port 到 ifindex 对应关系有误，相差6.
</li>
<li>hwL2VlanPortList 是 portlist 类型，命令行可以用 x（16进制字符串）类型赋值，但脚本中用的是bit类型。根据调试观察到的实际情况对 PortToList() 和 ListToPort 作了调整。
</li>
<li>目前命令行添加 vlan 的端口先改类型为 access， 删除时改回 hybrid， 有 <b>更复杂的需求么</b> ？
</li>
<li>修改设置端口速率和带宽的 PortControl()， 按照手册上操作顺序， 添加了先将端口 negotiation 设置为 noauto
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">ssh登录到node</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="todo DOING">DOING</span> root password什么时候用?</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>进入实验时可用当前实验的用户名密码登录
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">解决方法</h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li>安装cygwin
</li>
<li>创建C:\temp目录, 以便日志可写.
</li>
<li>按照ssh-mine网页说明, 下载程序, 将其与putty放到c:\cygwin\bin下面
</li>
<li>firefox创建文件关联
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="todo DOING">DOING</span> 图形化拓扑工具使用</h3>
<div class="outline-text-3" id="text-1-3">

<p>安装jre, 配置其安全级别, 使emulab网站上可执行applet
<a href="http://www.emulab.net/netlab/client.php3">http://www.emulab.net/netlab/client.php3</a>
</p>
</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="todo DOING">DOING</span> Bad Response</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>xmlrpc问题, wiz上记录了一个google论坛的相关问题, 首先看xmlrpc-server是否启动.
查看后发现该服务未启动, 提示未安装mysql-python模块.
</p><ol>
<li>下载MySQL-python-1.2.3.tar.gz
</li>
<li>设置setup<sub>posix</sub>.py文件中mysql<sub>config的位置</sub>
</li>
<li><code>python setup.py build</code>
</li>
<li><code>python setup.py install</code>
</li>
</ol>


<p>
但该问题仍存在，在解决虚拟节点问题时，更新了证书。之后该问题解决。
</p></div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="todo TODO">TODO</span> 用gui开始实验提示 none type</h4>
<div class="outline-text-4" id="text-1-3-2">


<p>
 <span class="timestamp-wrapper"> <span class="timestamp">2014-08-12 星期二</span></span><br/>
服务已经启动, 但仍存在问题.
</p></div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="todo TODO">TODO</span> free节点经常不成功</h3>
<div class="outline-text-3" id="text-1-4">

<p>主要原因是节点启动时控制网口识别出错. 思路:在节点上再次执行, 查看日志; DeathByDHCP.html
</p>
<p>
对应脚本是netif-emulab, 执行日志在/etc/emulab或/var/log, 结果在controlif里 (从脚本得到信息);
或执行 <code>kenv boot.netif.name</code>, <a href="https://trac.deterlab.net/wiki/Installation/Nodes">https://trac.deterlab.net/wiki/Installation/Nodes</a>
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="todo DOING">DOING</span> 虚拟节点使用, 连接探针</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>在ns中指定pcvm.
</li>
</ul>


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">虚拟节点启动不成功</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li>需要明确pc3000中imgid, ns文件中osid, next osid, jail osid与实验的关系
</li>
</ul>

<p>imgid仅需要指定一个，指定多个时，后面的覆盖前面的。jail osid是老的虚拟节点操作系统，现在已经不用
</p><ul>
<li>将 172.16 网段加入 boss:/etc/rc.conf 路由配置中
</li>
<li>证书过期，用命令更新证书
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="todo TODO">TODO</span> 指定时间的ns事件</h3>
<div class="outline-text-3" id="text-1-6">

<p>tutorial中Starting your application automatically小节里有支持.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">阅读 wiki 笔记</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">DeathByDHCP.html, 实验网DHCP问题</h3>
<div class="outline-text-3" id="text-2-1">

<p>节点有多个网口, DHCP时要判断出哪个是控制网口, 并且速度要快. 是个挑战.
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">常用命令</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>boss# nfree emulab-ops reloading pc2
</li>
<li>ops# node<sub>reboot</sub> &lt;node&gt;
</li>
<li>ops# node<sub>reboot</sub> -e proj, expr
</li>
<li>ops# eventsys<sub>control</sub> [-f] replay proj expt
</li>
<li>ops# portstats &lt;proj&gt; &lt;exp&gt; //switch statistics (such as packet counts) 
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-31T16:13+0800</p>
<p class="author">Author: ZHAO Xin</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
